import 'dart:core';

class Question {
  String question;
  final List<String> options;
  int answerIndex;
  Question({
    required this.question,
    required this.options,
    required this.answerIndex,
  });
}

final data = [
  Question(
    question:
        "ربنا عمل علينا واجبات وحمول لازم نشيلها.. منها اننا أحيانا بنقتل.. أنا مؤمن أن من يقتل يقتل.. وعارف أني هموت مقتول بس ده هو الثمن اللي لازم ادفعه",
    options: ["الإرهاب والكباب", "أرض الخوف", "احنا بتوع الأتوبيس"],
    answerIndex: 1,
  ),
  Question(
    question: "اقتناعي الشخصي أو عدمه لا يغير من الحقيقة في شيء",
    options: ["الكيف", "اللمبي", "احنا بتوع الأتوبيس"],
    answerIndex: 2,
  ),
  Question(
    question:
        "أنا مش في خدمة الوطن.. أنا في خدمة الباشا سيادة اللوا، وحرم الباشا سيادة اللوا، والعيال البشوات ولاد سيادة اللوا",
    options: ["الإرهاب والكباب", "الكيف", "النمر الأسود"],
    answerIndex: 0,
  ),
  Question(
    question:
        "الحجات بتيجي أول ما بنبطل ندور عليها أو نستناها.. المشكلة بقى هل لما هتيجي هنكون لسه جوانا نفس الشغف؟",
    options: ["الإنس والجن", "النمر الأسود", "طيور الظلام"],
    answerIndex: 1,
  ),
  Question(
    question: "اتسرقنا بكل الأشكال يا حسن!",
    options: ["اللعب مع الكبار", "الحب فوق هضبة الهرم", "طيور الظلام"],
    answerIndex: 0,
  ),
  Question(
    question: "كويس إن أبو الهول والأهرام لسه ما تسرقوش",
    options: ["اللعب مع الكبار", "الحب فوق هضبة الهرم", "طيور الظلام"],
    answerIndex: 0,
  ),
  Question(
    question:
        "لازم كل حاجة في بلدنا تبقى حجارة عشان ما تتسرقش.. حتى الحب والروح الحلوة اتسرقوا يا علي",
    options: ["اللعب مع الكبار", "الحب فوق هضبة الهرم", "طيور الظلام"],
    answerIndex: 0,
  ),
  Question(
    question: "شوفي يا قطة",
    options: ["حافية على جسر الذهب", "تيتو", "سلام يا صاحبي"],
    answerIndex: 0,
  ),
  Question(
    question: "أنا بابا يالا",
    options: ["حافية على جسر الذهب", "تيتو", "سلام يا صاحبي"],
    answerIndex: 1,
  ),
  Question(
    question: "سلام يا صاحبي",
    options: ["تيتو", "سلام يا صاحبي", "حافية على جسر الذهب"],
    answerIndex: 1,
  ),
  Question(
    question: "أنا عملت كل حاجة غلط ممكن تتخيلها",
    options: ["عبود ع الحدود", "تيتو", "الناظر"],
    answerIndex: 1,
  ),
  Question(
    question: "عايز تحتفل بالالتصاق يا صايع يا ملتصق",
    options: ["تيتو", "عبود ع الحدود", "سلام يا صاحبي"],
    answerIndex: 1,
  ),
  Question(
    question: "جبت الترنك معاك",
    options: ["عبود ع الحدود", "الناظر", "تيتو"],
    answerIndex: 1,
  ),
  Question(
    question: "يا عزيزي كلنا لصوص",
    options: ["الناظر", "يا عزيزي كلنا لصوص", "عبود ع الحدود"],
    answerIndex: 1,
  ),
  Question(
    question: "الله يرحمها أم مختار كانت غالية علينا أوي",
    options: ["يا عزيزي كلنا لصوص", "اللمبي", "عبود ع الحدود"],
    answerIndex: 1,
  ),
  Question(
    question: "أيوه، قولي حاجة من اللي ربنا كتبها علينا",
    options: ["اللمبي", "صعيدي في الجامعة الأمريكية", "يا عزيزي كلنا لصوص"],
    answerIndex: 1,
  ),
  Question(
    question: "أحلى من الشرف مفيش",
    options: ["صعيدي في الجامعة الأمريكية", "أحبك يا حسن", "اللمبي"],
    answerIndex: 1,
  ),
  Question(
    question: "هاروح اتحزم وأجيلك",
    options: ["أحبك يا حسن", "سيدة القصر", "اللمبي"],
    answerIndex: 1,
  ),
  Question(
    question: "ادي كل واحد مربع واداني أربع مربعات",
    options: ["سيدة القصر", "عبود ع الحدود", "أحبك يا حسن"],
    answerIndex: 1,
  ),
  Question(
    question: "أقولك فين ولا تزعلش",
    options: ["عبود ع الحدود", "أخطر رجل في العالم", "سيدة القصر"],
    answerIndex: 1,
  ),
  Question(
    question: "اوعي يغرك جسمك",
    options: ["أخطر رجل في العالم", "الناظر", "عبود ع الحدود"],
    answerIndex: 1,
  ),
  Question(
    question: "هنرقص دانس يا روح أمك",
    options: ["الناظر", "الفرن", "أخطر رجل في العالم"],
    answerIndex: 1,
  ),
  Question(
    question: "انت مش ابني، انت لقيط",
    options: ["طير إنت", "الخطايا", "الناظر"],
    answerIndex: 1,
  ),
  Question(
    question: "أنا قلت كلمتي مش ممكن تنزل الأرض أبداً",
    options: ["الناظر", "ابن حميدو", "الخطايا"],
    answerIndex: 1,
  ),
  Question(
    question: "هاروح اتحزم وأجيلك",
    options: ["ابن حميدو", "سيدة القصر", "الناظر"],
    answerIndex: 1,
  ),
  Question(
    question: "انت مش ابني، انت لقيط",
    options: ["سيدة القصر", "الخطايا", "الناظر"],
    answerIndex: 1,
  ),
  Question(
    question: "زكريا الدرديري مدرس رياضيات وفرنساوي",
    options: ["الخطايا", "الناظر", "اللمبي"],
    answerIndex: 1,
  ),
  Question(
    question: "فتشني فتش",
    options: ["الناظر", "ابن حميدو", "الخطايا"],
    answerIndex: 1,
  ),
  Question(
    question: "يا ناس يا لوكال يا شعبيين",
    options: ["طير إنت", "أتش دبور", "اللمبي"],
    answerIndex: 1,
  ),
  Question(
    question: "ست أنا مش شايف قدامي أيتها ست",
    options: ["سكر هانم", "الناظر", "ابن حميدو"],
    answerIndex: 0,
  ),
  Question(
    question: "ماما .. ياروح أمك",
    options: ["اشاعة حب", "النمر الأسود", "الكيف"],
    answerIndex: 0,
  ),
  Question(
    question: "انت جاي تعزي ولا جاي تهزر؟ لأ أنا جاي أهزر",
    options: ["الكيف", "النمر الأسود", "اشاعة حب"],
    answerIndex: 0,
  ),
  Question(
    question: "كابتن كابتن هو كله ضرب ضرب مفيش شتيمة",
    options: ["صعيدي في الجامعة الأمريكية", "اللعب مع الكبار", "الناظر"],
    answerIndex: 2,
  ),
  Question(
    question: "دنا بدهبزه ودهرزه عشان يبرعش ويحنكش ويبقى اخر طعطعه",
    options: ["الكيف", "اللمبي", "النمر الأسود"],
    answerIndex: 0,
  ),
  Question(
    question: "قولي عملك ايه كرشي، كرشي اللي انت ناسيه قولي",
    options: ["اللمبي", "عبود ع الحدود", "النمر الأسود"],
    answerIndex: 1,
  ),
  Question(
    question: "انسان الغاب طويل الناب",
    options: ["ابن حميدو", "النمر الأسود", "الكيف"],
    answerIndex: 0,
  ),
  Question(
    question: "الإنسان دعيف",
    options: ["ابراهيم الأبيض", "اللمبي", "أحبك يا حسن"],
    answerIndex: 0,
  ),
  Question(
      question: "ويل للعالم إذا انحرف المتعلمون وتبهيظ المثقفون",
      options: [
        "النمر الأسود",
        "اللعب مع الكبار",
        "البيضة والحجر",
      ],
      answerIndex: 2),
  Question(
      question: "يمان واطي انت",
      options: ["طير إنت", "ظرف طارق", "زكي شان"],
      answerIndex: 1),
  Question(
    question: "احنا في زمن المسخ",
    options: ["عمارة يعقوبيان", "الجزيرة", "خارج علي القانون"],
    answerIndex: 0,
  ),
  Question(
    question: "من النهاردة مفيش حكومة أنا الحكومة",
    options: ["الجزيرة", "الكيف", "خارج علي القانون"],
    answerIndex: 0,
  ),
  Question(
    question: "الجواز مش للغلابة اللي زينا",
    options: ["الحب فوق هضبة الهرم", "تيتو", "الإنسان يعيش مرة واحدة"],
    answerIndex: 0,
  ),
  Question(
    question:
        "في بلدنا ابن الضابط لازم يطلع ضابط و ابن تاجر المخدرات لازم يطلع تاجر مخدرات",
    options: ["خارج علي القانون", "عمارة يعقوبيان", "الحب فوق هضبة الهرم"],
    answerIndex: 0,
  ),
  Question(
    question:
        "انا عندي حبوب للضحك و حبوب للكلام و حبوب للسعادة بس ماعنديش حبوب للحزن عشان ده موجود طبيعي",
    options: [
      "الإنسان يعيش مرة واحدة",
      "الحب فوق هضبة الهرم",
      "خارج علي القانون"
    ],
    answerIndex: 0,
  ),
  Question(
    question: "اللي يشوف البلد دي من فوق غير اللي يشوفها من تحت",
    options: ["طيور الظلام", "عمارة يعقوبيان", "الجزيرة"],
    answerIndex: 0,
  ),
  Question(
    question: "مشكلة ابويا انه مش قادر يصدق انه اعمى",
    options: ["الكيت كات", "الإنسان يعيش مرة واحدة", "الحب فوق هضبة الهرم"],
    answerIndex: 0,
  ),
  Question(
    question: "عاش خاين ومات كافر",
    options: ["خيانة مشروعة", "عمارة يعقوبيان", "بئر الخيانة"],
    answerIndex: 2,
  ),
  Question(
    question: "كلنا فاسدون لا استثني احدا حتى بالصمت العاجز",
    options: ["ضد الحكومة", "طيور الظلام", "الحب فوق هضبة الهرم"],
    answerIndex: 0,
  ),
  Question(
    question: "الكنز في الرحلة.. في الناس اللي بتقابلهم بتحبهم وبيحبوك",
    options: ["تيتو", "خارج علي القانون", "عمارة يعقوبيان"],
    answerIndex: 0,
  ),
  Question(
    question: "الحكومة مالهاش دراع عشان تتلوي منه",
    options: ["الارهاب والكباب", "الخطايا", "طيور الظلام"],
    answerIndex: 0,
  ),
  Question(
    question: "انت فاتك قطر الجواز؟ انا فاتتني قطارات كتير",
    options: ["المنسي", "ضد الحكومة", "تيتو"],
    answerIndex: 0,
  ),
  Question(
    question:
        "احنا صغيرين قوي ياسيد.. لا يا امي احنا كبار بس مش عارفين نشوف نفسينا",
    options: [
      "اضحك خللي الصورة تطلع حلوة",
      "عمارة يعقوبيان",
      "الحب فوق هضبة الهرم"
    ],
    answerIndex: 0,
  ),
  Question(
    question: "انا زعلانه أوى من الدنيا يا فاطمة",
    options: ["عن العشق والهوى", "طيور الظلام", "ضد الحكومة"],
    answerIndex: 0,
  ),
  Question(
    question: "انا امي بتتخن من الجوع",
    options: ["حين ميسرة", "عمارة يعقوبيان", "الحب فوق هضبة الهرم"],
    answerIndex: 0,
  ),
  Question(
    question: "شعبي يقول عليا ايه متواطيء معاكم",
    options: ["أيام السادات", "الحب فوق هضبة الهرم", "بئر الخيانة"],
    answerIndex: 0,
  ),
  Question(
    question: "انا حلمي كان صغير و فضل يصغر يصغر لحد ما اختفي و مابقتش اشوفه",
    options: ["عبود على الحدود", "عمارة يعقوبيان", "الكيت كات"],
    answerIndex: 0,
  ),
  Question(
    question: "عاوز تبقى نضيف الفلوس هي اللي هتخليك نضيف",
    options: ["تيتو", "خارج علي القانون", "عمارة يعقوبيان"],
    answerIndex: 0,
  ),
  Question(
    question: "محدش بينجرح قوي غير لما بيحب قوي",
    options: ["أحلام عمرنا", "ضد الحكومة", "حين ميسرة"],
    answerIndex: 0,
  ),
  Question(
    question:
        "كانت أيام ما تتعوضش كان عندنا قوة وقلب عشان كنا رجالة ووقفنا وقفة رجالة وأخرتها دي النتيجة اللي وصلنالها قاعدن بنشكي ونولول زي النسوان",
    options: ["الأرض", "المنسي", "عمارة يعقوبيان"],
    answerIndex: 0,
  ),
  Question(
    question: "انا بقيت زى الجزيرة اقرب واحد ليا علي البر التاني",
    options: ["الجزيرة", "الحب فوق هضبة الهرم", "المشبوه"],
    answerIndex: 0,
  ),
  Question(
    question:
        "في ناس بتنفخ في النار لكن انا عايز افكرهم ان الديمقراطية لها أنياب",
    options: ["أيام السادات", "عمارة يعقوبيان", "بئر الخيانة"],
    answerIndex: 0,
  ),
  Question(
    question:
        "دورى على اللى تعرفي تعيشي معاه، مش ماتعرفيش تستغني عنه، وصدقيني محدش بيموت من الحب",
    options: ["السلم و التعبان", "الحب فوق هضبة الهرم", "أيام السادات"],
    answerIndex: 0,
  ),
  Question(
    question:
        "كلهم كدابين وكلهم عارفين انهم كدابين وكلهم عارفين اننا عارفين انهم كدابين، وبرضو مستمرين ف الكدب",
    options: ["الحب فوق هضبة الهرم", "عمارة يعقوبيان", "خارج علي القانون"],
    answerIndex: 0,
  ),
  Question(
    question:
        "بقيت أحس إني محكوم عليا بالوحدة، متعلق في الهوا لا قادر أمسك حاجة بإيديا ولا في أرض تحتيا",
    options: ["أرض الخوف", "عمارة يعقوبيان", "ضد الحكومة"],
    answerIndex: 0,
  ),
  Question(
    question:
        "انا حاسس ان ربنا بيعذبني في الدنيا عشان شايل لي فرحة كبيرة قوي في الاخرة",
    options: ["الاخوة الاعداء", "عمارة يعقوبيان", "الحب فوق هضبة الهرم"],
    answerIndex: 0,
  ),
  Question(
    question: "كلكم عايزين تبقوا فتوات؟ امال مين اللي حينضرب؟",
    options: ["الشيطان يعظ", "عمارة يعقوبيان", "ضد الحكومة"],
    answerIndex: 0,
  ),
  Question(
    question: "الحشيش لو حلال ادينا بنشربه و لو حرام ادينا بنحرقه",
    options: ["الكيف", "عمارة يعقوبيان", "العار"],
    answerIndex: 2,
  ),
  Question(
    question: "ده النيل و ده الهرم دي مصر ياعبلة",
    options: ["الصعود الي الهاوية", "الحب فوق هضبة الهرم", "ضد الحكومة"],
    answerIndex: 0,
  ),
  Question(
    question: "انا مش تبع حد انا رئيس جمهورية نفسي",
    options: ["اتش دبور", "ظرف طارق", "مطب صناعي "],
    answerIndex: 1,
  ),
  Question(
    question: "يارب...انت عارف بقا",
    options: ["اللي بالي بالك", "اللمبي", "الناظر"],
    answerIndex: 1,
  ),
  Question(
    question: "انا محترم مع المحترم وقليل الادب مع ابن المضايقة",
    options: ["لا تراجع ولا استسلام", "طير انت", "اتش دبور"],
    answerIndex: 2,
  ),
  Question(
    question: "إيه اللي جاب القلعة جنب البحر",
    options: ["اللمبي", "صايع بحر", "عوكل"],
    answerIndex: 2,
  ),
  Question(
    question: "الجرأة حلوة مفيش كلام",
    options: ["الكيت كات", "ابراهيم الابيض", "الكيف"],
    answerIndex: 1,
  ),
  Question(
    question: "روح يا شيخ ... وتعالى بسرعة",
    options: ["اللي بالي بالك", "اللمبي", "اللمبي 8 جيجا"],
    answerIndex: 1,
  ),
  Question(
    question: "لقد انتابتني القشعريرة",
    options: ["اتش دبور", "طير انت", "لا تراجع ولا استسلام"],
    answerIndex: 1,
  ),
  Question(
    question: "ما خلاص يوحش بقا",
    options: ["فول الصين العظيم", "رمضان مبروك ابو العلمين حمودة", "عوكل"],
    answerIndex: 0,
  ),
  Question(
    question: "انت فاجئتني بالموضوع دا",
    options: ["مطب صناعي", "لخمة راس", "خارج عن القانون "],
    answerIndex: 1,
  ),
  Question(
    question: "معنديش جيب ورا",
    options: ["تتح", "اللمبي", "الناظر"],
    answerIndex: 1,
  ),
];
